Repository: gramps-project/contrib
Catalog: Betawhatsnext/po/*.po
Languages: fr

source: Beta What's Next
fr: Bêta Prochaines étapes

source: Beta Gramplet suggesting items to research
fr: Gramplet bêta suggérant des éléments à rechercher

source: Beta What's Next?
fr: Bêta Que faire ensuite ?

source: ⛔ A local Genealogical Tree database has not yet been loaded.
fr: ⛔ Aucune base de données d'arbre généalogique local n'a encore été chargée.

source: 👣 Next Steps:
fr: 👣 Prochaines étapes :

source: • From the "Family Trees" menu,
fr: • Dans le menu "Arbres familiaux",

source: use the "Manage Family Trees..." option to
fr: utilisez l'option "Gérer les arbres familiaux..." pour

source: create a New (or to select an existing) Tree database.
fr: créer une nouvelle base de données d'arbre (ou en sélectionner une existante).

source: • Click the "Load Family Tree" button to begin
fr: • Cliquez sur le bouton "Charger l'arbre familial" pour commencer

source: working with the selected genealogical tree.
fr: à travailler avec l'arbre généalogique sélectionné.

source: Create and load an empty new tree to import a backup (or
fr: Créez et chargez un nouvel arbre vide pour importer une sauvegarde (ou

source: GEDCOM file) from another genealogical tool.
fr: un fichier GEDCOM) d'un autre outil généalogique.

source: Use the "Configure" in the "View" menu to change the Gramplet options.
fr: Utilisez "Configurer" dans le menu "Affichage" pour modifier les options du Gramplet.

source: Search Quota
fr: Quota de recherche

source: Depth per loop
fr: Profondeur par boucle

source: Pause search expansion
fr: Pause de l'expansion de recherche

source: Completed Person
fr: Personne complétée

source: Completed offspring Families
fr: Familles de descendants complétées

source: Ignore Person or Family
fr: Ignorer la personne ou la famille

source: ⛔ The current Tree database contains no people.
fr: ⛔ La base de données de l'arbre actuel ne contient aucune personne.

source: 👣 Next Steps: Add a Family and a person in that family: • A Family may be added via the "Add" menu • A person may be added by pressing the "+" (plus) in the spouse ("Father/partner1" or "Mother/partner2") panels or "Children" tab. Or Import People from an external file: • An external file may be used to populate the tree via "Import..." in the "Family Trees" menu.
fr: 👣 Prochaines étapes : Ajoutez une famille et une personne dans cette famille : • Une famille peut être ajoutée via le menu "Ajouter" • Une personne peut être ajoutée en appuyant sur le "+" (plus) dans les panneaux des conjoints ("Père/partenaire1" ou "Mère/partenaire2") ou l'onglet "Enfants". Ou importez des personnes à partir d'un fichier externe : • Un fichier externe peut être utilisé pour peupler l'arbre via "Importer..." dans le menu "Arbres familiaux".

source: ⛔ No Person has been chosen as the focal "Home Person".
fr: ⛔ Aucune personne n'a été choisie comme "Personne de référence".

source: 👣 Next Steps: • Select the People view icon in the Navigator sidebar. • Select someone to make them the "Active Person". • Choose "Set Home Person" from the Edit menu or from the (right-click) context menu. This sets them as the focal "Home Person".
fr: 👣 Prochaines étapes : • Sélectionnez l'icône de vue des personnes dans la barre latérale du Navigateur. • Sélectionnez quelqu'un pour en faire la "Personne active". • Choisissez "Définir comme personne de référence" dans le menu Édition ou dans le menu contextuel (clic droit). Cela les définit comme "Personne de référence" centrale.

source: Double-click color text to edit details
fr: Double-cliquez sur le texte en couleur pour modifier les détails

source: first name unknown
fr: prénom inconnu

source: surname unknown
fr: nom de famille inconnu

source: (person with unknown name)
fr: (personne au nom inconnu)

source: Birth event missing.
fr: Événement de naissance manquant.

source: Add via the Events tab of the Edit Person dialog.
fr: Ajoutez via l'onglet Événements de la boîte de dialogue Modifier la personne.

source: {inspect.currentframe().f_lineno} person not complete
fr: {inspect.currentframe().f_lineno} personne incomplète

source: (unknown person)
fr: (personne inconnue)

source: %(name1)s and %(name2)s
fr: %(name1)s et %(name2)s

source: marriage event missing
fr: événement de mariage manquant

source: relationship type unknown
fr: type de relation inconnu

source: Add via the Events tab of the Edit Family dialog.
fr: Ajoutez via l'onglet Événements de la boîte de dialogue Modifier la famille.

source: 591 family not complete
fr: 591 famille incomplète

source: date unknown
fr: date inconnue

source: date incomplete
fr: date incomplète

source: place unknown for the Event
fr: lieu inconnu pour l'événement

source: A partner relationship exists but the spouse is missing
fr: Une relation de partenariat existe mais le conjoint est manquant

source: Add missing partner using the Edit Family dialog.
fr: Ajoutez le partenaire manquant en utilisant la boîte de dialogue Modifier la famille.

source: Father missing from the parent family
fr: Père manquant dans la famille parentale

source: Mother missing from the parent family
fr: Mère manquante dans la famille parentale

source: Parent family is unknown.
fr: La famille parentale est inconnue.

source: "Add New/Existing Parents" from the Edit menu of the Relationships view.
fr: "Ajouter de nouveaux parents/parents existants" dans le menu Édition de la vue Relations.
